# 견적 요청 상태값 정의
Req_status = (
    ('A', '접수'),
    ('R', '요청'),
    ('S', '제안'),
    ('O', '발주'),
    ('C', '변경'),
    ('F', '실패'),
)
# 상품 구분
Product_Div = (
    ('DT', '데스크탑'),
    ('NT', '노트북'),
    ('MT', '모니터'),
    ('SR', '세단기'),
    ('ET', '기타'),
)
# 견적 요청 상태값 정의
Product_status = (
    ('A', '운영중'),
    ('X', '단종'),
)
# 가격제안 상태 값
Offer_status = (
#    ('P','승인전'),
#    ('A','승인'),
#    ('R','반려'),
    ('S','제안'),
    ('O','발주'),
    ('C','변경'),
    ('F','실패'),
)

# 매입사 거래 상태 값
Vendor_status = (
    ('1','거래중'),
    ('9','종료'),
)

# 사양관련
# 데스크탑
DT_enumtype = (
    ('T', '타워'),
    ('S', '슬림'),
    ('M', '미니'),
    ('E', '기타'),
)
# 노트북
NT_enumtype = (
    ('L', '보급'),
    ('M', '일반'),
    ('H', '고급'),
    ('G', '게이밍'),
)
# 모니터
MT_enumtype = (
    ('N', '일반'),
    ('C', '커브드'),
)
# CPU타입
CPU_enumtype = (
    ('1', '펜티엄'),
    ('3', '셀러론'),
    ('5', 'i3'),
    ('7', 'i5'),
    ('9', 'i7'),
    ('11', 'i9'),
    ('51', 'AMD'),
    ('99', '기타'),
)

# RAM구분
RAM_enumtype = (
    ('1','2GB'),
    ('2','4GB'),
    ('3','8GB'),
    ('4','16GB'),
    ('5','32GB'),
    ('6','64GB')
)
# HDD구분
HDD_enumtype = (
    ('0','None'),
    ('1', '500GB'),
    ('3', '1TB'),
    ('5', '2TB'),
    ('7', '3TB'),
    ('9', '4TB'),
    ('10', '4TB초과'),
)
# SSD구분
SSD_enumtype = (
    ('0','None'),
    ('1', '64GB'),
    ('2', '120GB'),
    ('3', '128GB'),
    ('4', '250GB'),
    ('5', '256GB'),
    ('6', '500GB'),
    ('7', '512GB'),
    ('8', '1TB'),
    ('9', '2TB'),
    ('10', '2TB초과'),
)
# 화면비율
Ratio_enumtype = (
    ('1', '4:3'),
    ('3', '16:9'),
    ('5', '21:9'),
)
# 해상도
Resolution_enumtype = (
    ('1','HD이하'),
    ('3','FHD(1920x1080)'),
    ('5','WFHD(2560x1080)'),
    ('7','WQHD(2560x1440)'),
    ('9','UWQHD(3440x1440)'),
    ('11','4KUHD(3840x2160)'),
    ('13','4KUHD초과'),
)
# 패널타입
Panel_enumtype = (
    ('1','IPS'),
    ('3','VA'),
    ('5','TN'),
    ('7','PLS'),
    ('9','AHVA'),
    ('11','AD-PLS'),
)
# 응답속도
ReqSpeed_enumType = (
    ('1','1-4'),
    ('2','5-8'),
    ('3','9-12'),
    ('4','13-16'),
    ('5','17-20'),
    ('6','21-'),
)

# 명암비
BWRatio_enumtype = (
    ('1','800:1 이하'),
    ('2','801-1,000:1'),
    ('3','1,001:1-3,000:1'),
    ('4','3,001:1-4,999:1'),
    ('5','5000:1이상'),
)

# 상품발주 주문상태
OrderStatus_enumtype = (
    ('RW','발주전'),
    ('RO','발주요청'),
    ('TI','배송중'),
    ('TC','배송완료'),
    ('IN','인수증'),
)

# PO상태
OrderPOStatus_enumtype = (
    ('NO','진행전'),
    ('SQ','판매품의'),
    ('EP','전자결재'),
    ('PO','PO생성'),
    ('IC','재고생성'),
    ('SC','매출완료'),
)

# 배송상태
LogiType_enumtype = (
    ('D','직배송'),
    ('L','택배'),
    ('S','상동'),
)

LogiCompany_enumtype = (
    ('1','CJ대한통운'),
    ('2','우체국택배'),
    ('3','한진택배'),
    ('4','롯데택배'),
    ('5','로젠택배'),
    ('6','경동택배'),
)

# 사용자 구분
UserType_enumtype = (
    ('A','관리자'),
    ('I','ITS담당'),
    ('M','ITS관리자'),
    ('S','영업사원'),
    ('V','벤더'),
)

# 렌탈 진행 구분
RentalStatus_enumtype = (
    ('I','진행중'),
    ('R','만료'),
    ('S','중도해지'),
)

# 렌탈 타입 구분
RentalType_enumtype = (
    ('S','매출'),
    ('R','재렌탈'),
)

# 메뉴 구분
DevBBSMenuDiv_enumtype = (
    ('0','기본관리'),
    ('1','견적관리'),
    ('2','발주관리'),
    ('3','손익관리'),
    ('4','진도관리'),
    ('5','기타'),
    ('C','공통관리'),
)

DevBBSStatus_enumtype = (
    ('R','요청'),
    ('A','접수'),
    ('I','수정중'),
    ('C','수정완료'),
)

DevPriority_enumtype = (
    ('1','상'),
    ('5','중'),
    ('9','하'),
)

DevDifficulty_enumtype = (
    ('1', '상'),
    ('5', '중'),
    ('9', '하'),
)